---
kind: method
id: M:Autodesk.Revit.DB.TextNote.SetFormattedText(Autodesk.Revit.DB.FormattedText)
zh: 注释、文字注释
source: html/1bb2b0cc-04b1-9279-d21e-5b67d30dfe81.htm
---
# Autodesk.Revit.DB.TextNote.SetFormattedText Method

**中文**: 注释、文字注释

Sets the text and associated formatting of the text of in this text note with
 a given FormattedText object.

## Syntax (C#)
```csharp
public void SetFormattedText(
	FormattedText formattedText
)
```

## Parameters
- **formattedText** (`Autodesk.Revit.DB.FormattedText`) - The FormattedText object containing the text and associated formatting of the text.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null